HELP_1 = """✅**<u>اوامر الادمن:</u>**

↺اوامر التحكم بالبوت في المكالمات داخل الجروبات والقنوات ...↻

✘ **ايقاف مؤقت** ✘/n/n↤لايقاف الاغنية او الفيديو مؤقتا .
✘ **استئناف** ✘/n/n↤لاستكمال الاغنية او الفيديو .
✘ **تخطي** ✘/n/n↤لتخطي الاغنية الحالية .
✘ **ايقاف** ✘/n/n↤لانهاء الاغنية ونزول الحساب المساعد من الاتصال .
✘ **القايمه** ✘/n/n↤لعرض معلومات عن الفيديو او الاغنية الحالية وعرض الاغاني التاليه . """

HELP_2 = """**<u> اوامر المالك فقط</u>**


✘ **رفع ادمن** ✘/n/n↤بالرد او باليوزر او الايدي لرفع المستخدم ادمن في البوت .
✘ **تنزيل ادمن** ✘/n/n↤بالرد او باليوزر او بالايدي لتنزيل ادمن من البوت .
✘ **الادمنية** ✘/n/n↤لعرض قائمة الادمنية في البوت .
✘ **رفع الادمنيه** ✘/n/n↤لتحديث قائمة الادمنيه ...يجب كتابة الامر بعد رفع ادمن جديد

**ملحوظه:-**/n/n↤عند رفع مستخدم ادمن بالبوت ياخذ صلاحيات نفس صلاحيات البوت .."""

HELP_3 = """**اوامر الحظر** ( للمـطـورين) 

**<u>حظر القنوات والجروبات: </u>**
✘ **حظر قناة + ايدي القناة او الجروب** ✘/n/n↤لحظر القناة او الجروب من استخدام البوت

✘ **الغاء حظر قناة + ايدي القناة او الجروب** ✘/n/n↤لالغاء حظر قناة او جروب
✘ **القنوات المحظورة** ✘/n/n↤لعرض القنوات التي تم حظرها من استخدام البوت


**<u>حظر المستخدمين: </u>**

✘ **حظر** ✘/n/n↤بالرد او + اليوزر او الايدي لحظر المستخدم من استخدام البوت

✘ **الغاء حظر** ✘/n/n↤لالغاء حظر المستخدم

✘ **المحظورين** ✘/n/n↤لعرض قائمة المحظورين من استخدام البوت."""

HELP_4 = """🍒 <u> اوامر الاذاعة</u> [للمطـورين فقـط] :

✘ **اذاعة بالتثبيت + الرسالة او بالرد علي الرسالة** ✘/n/n↤لاذاعة الرسالة في جروبات وقنوات البوت مع تثبيتها . 
✘ **اذاعة بالتنبيه + الرسالة او بالرد علي الرسالة** ✘/n/n↤لاذاعة الرسالة في الجروبات والقنوات مع التثبيت وتنبيه الاعضاء. 
✘ **اذاعة خاص + الرسالة او بالرد علي الرسالة** ✘/n/n↤لاذاعة الرساله للاعضاء المشتركين في خاص البوت.
✘ **اذاعة بالمساعد + الرسالة او بالرد علي الرسالة** ✘/n/n↤لاذاعة الرسالة من الحساب المساعد الي الجروبات والقنوات والخاص الموجود في الحساب المساعد ( بلاشها عشان الحظر) .
✘ **اذاعة ايقاف** ✘/n/n↤لايقاف الاذاعة.
"""
HELP_5 = """
😉 **<u>الاوامر الاضافية :</u>**

✘ **تكرار + [تفعيل - تعطيل]** ✘/n/n↤لتكرار الاغنية الحالية 10 مرات .
✘ **تكرار + [عدد التكرار]** ✘/n/n↤لتكرار الاغنية الحالية عدد معين من التكرار. 
✘ **خلط** ✘/n/n↤لاعادة ترتيب الاغاني المطلوبة بطريقة عشوائية.
✘ **قدم + عدد الثواني** ✘/n/n↤لتقديم الاغنية الحالية عدد من الثواني.
✘ **رجع + عدد الثواني** ✘/n/n↤لارجاع الاغنية الحالية عدد من الثواني.
✘ **ليركس + اسم الاغنية** ✘/n/n↤لجلب كلمات الاغنية.
✘ **تحميل + اسم الاغنية او الرابط** ✘/n/n↤لتحميل الاغنية او الفيديو بجودات مختلفة علي حسب اختيارك. 
"""

HELP_6 = """🤨 **<u>قائمة تشغيل السيرفر :</u>**

✘ **قائمة التشغيل** ✘/n/n↤لجلب قائمة التشغيل الخاصة بك.
✘ **حذف قائمة التشغيل** ✘/n/n↤لحذف قائمة التشغيل الخاصة بك .
✘ **تشغيل** ✘/n/n↤لبدء التشغيل من قائمة التشغيل الخاصة بك او من قائمة تشغيل السيرفر. """

HELP_7 = """😎 **<u>البينج والاحصائيات :</u>**

✘ **بينج** ✘/n/n↤لعرض حالة البوت و سرعة التشغيل .
✘ **الاحصائيات** ✘/n/n↤لجلب احصائيات المجموعات والخاص و قائمة التوب 10 للجروب والسيرفر كامل."""

HELP_8 = """✅<u>**اوامرالتشغيل :**</u>

↻اوامر تشغيل البوت بالجروبات والقنوات ....↺

✘ **تشغيل** ✘/n/n↤+ اسم الاغنية او الرابط لتشغيل الاغنية في المكالمة .

✘ **فيديو** ✘/n/n↤+ اسم الفيديو او الرابط لتشغيل الفيديو في المكالمة.

✘ **لايف** ✘/n/n↤+ رابط اللايف لعرضه بالمكالمة. 

✘ **قناة + يوزر القناة او الايدي** ✘/n/n↤لتشغيل الاغاني بالقناة من الجروب (عشان متكتبش اوامر ف القناة وتبوظ الدنيا).

✘ **قناة + تعطيل** ✘/n/n↤لايقاف تشغيل الاغاني في القناة من الجروب. """


HELP_9 = """🥀 **<u>اوامر المطور :</u>**

🥺 **<u>اضافة مطورين ثانويين :</u>**

✘ **رفع مطور ثانوي** ✘/n/n↤بالرد او اليوزر.
✘ **تنزيل مطور ثانوي** ✘/n/n↤بالرد او اليوزر.
✘ **الثانويين** ✘/n/n↤لعرض قائمة المطورين الثانويين.


🥶 **<u>اوامر هيروكو :</u>**


✘ **الاستخدام** ✘/n/n↤لعرض استهلاك الدينو الشهري.


🤯 **<u>اوامر الفارات :</u>**


✘ **جلب فار** ✘/n/n↤لجلب احد الفارات من هيروكو.
✘ **حذف فار** ✘/n/n↤لحذف احد الفارات من هيروكو.
✘ **اضف فار** ✘/n/n↤لاضافة احد الفارات الي هيروكو.


🤓 **<u>اوامر البوت:</u>**


✘ **ريستارت** ✘/n/n↤لاعادة تشغيل الدينو تلقائيا ويمكنك تشغيله يدويا من هيروكو.
✘ **تحديث** ✘/n/n↤لتحديث البوت .
✘ **السيرفر** ✘/n/n↤لعرض بيانات السيرفر.
✘ **الصيانة + [ تفعيل - تعطيل ]** ✘/n/n↤لتفعيل وضع صيانة البوت قبل التعطيل .
✘ **الدخول + [ تفعيل - تعطيل ]** ✘/n/n↤عند التفعيل يقوم البوت بارسال اخطار للمالك عند اضافته الي جروب او قناة.
✘ **جلب الدخول** ✘/n/n↤لعرض اخر 100 حدث في سيرفر البوت (تستخدم لتحديد الاعطال في البوت) .


💔 **<u>اوامر البوتات الغير خدمية :</u>**


✘ **تفعيل المدفوع + ايدي الجروب** ✘/n/n↤للسماح لمالك الجروب بتشغيل البوت في جروبه.
✘ **تعطيل المدفوع + ايدي الجروب** ✘/n/n↤لالغاء تشغيل البوت في الجروب.
✘ **المدفوع** ✘/n/n↤لعرض الجروبات المسموح لها بتشغيل البوت."""
HELP_10 = """🤑 **<u>اوامر المحادثات النشطة :</u>**


✘ **الصوت** ✘/n/n↤لعرض عدد المكالمات الصوتيه الحالية في البوت.

✘ **الفيديو** ✘/n/n↤لعرض عدد مكالمات الفيديو الحالية في البوت.

✘ **انهاء تلقائي + [ تفعيل - تعطيل ]** ✘/n/n↤عند التفعيل يقوم البوت بقفل المكالمة تلقائيا عن عدم تواجد اشخاص في المكالمة. 
"""

HELP_11 = """😅**<u>اساسيات البوت</u>**

✘ **تفعيل** ✘/n/n↤لتفعيل البوت في القنوات والمجموعات.
✘ **الاوامر** ✘/n/n↤لعرض اوامر البوت.
✘ **اعادة تشغيل** ✘/n/n↤لاعادة تسغيل البوت في جروبك او قناتك.
✘ **الاعدادات** ✘/n/n↤لظبط اعدادات البوت في جروبك او قناتك.
✘ **المطورين** ✘/n/n↤لعرض مطورين البوت للابلاغ في حالة وجود اخطاء في البوت او امر لا يعمل. 
"""

HELP_12 = """🤬 **<u>الحظر العام: </u>** [للمطورين فقط] :

✘ **حظر عام** ✘/n/n↤باليوزر او بالرد لحظر المستخدم من جمع الجروبات والقنوات المتواجد فيها البوت.

✘ **الغاء حظر عام** ✘/n/n↤باليوزر او بالرد لالغاء حظر المستخدم من الجروبات والقنوات.

✘ **المحظورين عام** ✘/n/n↤لعرض قائمة المحظورين عام في البوت."""
